app/views/students/index.html.erb

SELECT "students".* FROM "students"
SELECT COUNT(*) FROM "students"
---
<ol>
<% if !Student.all.empty? %>