app/controllers/students_controller.rb

  def show
    if @student = Student.find_by(:id => params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]