app/controllers/student_controller.rb

SELECT "students".* FROM "students"
---
  def index
    students = Student.all